_posts_bak/2022-02-02-boj-1719.html
---
layout: post
title: BOJ 1719 택배
tags: 최단거리
---

<div id="outline-container-org57f81de" class="outline-2">
<h2 id="org57f81de">BOJ 1719 택배</h2>
<div class="outline-text-2" id="text-org57f81de">
<ul class="org-ul">
<li>경로표는 한 집하장에서 다른 집하장으로 최단경로로 화물을 이동시키기 위해 가장 먼저 거쳐야 하는 집하장</li>
</ul>
</div>
</div>

<div id="outline-container-org1a09e03" class="outline-2">
<h2 id="org1a09e03">접근하기</h2>
<div class="outline-text-2" id="text-org1a09e03">
<pre class="example">
1. 플로이드 와샬 알고리즘으로 table구성

i -&gt; k -&gt; j 이면 a[i][j] = a[i][k]를 담으면 됨
</pre>
</div>
</div>


<div id="outline-container-org4de7686" class="outline-2">
<h2 id="org4de7686"><span class="todo TODO">TODO</span> 코드 - 다익스트라</h2>
</div>

<div id="outline-container-orgfda07c3" class="outline-2">
<h2 id="orgfda07c3">코드 - 플로이드 와샬</h2>
<div class="outline-text-2" id="text-orgfda07c3">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">FASTIO</span> <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>); cin.tie(<span style="color: #8ae234;">NULL</span>);
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">INF</span> 1e9

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">M</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dp</span>[202][202];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">arr</span>[202][202];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234; font-weight: bold;">FASTIO</span>
<span style="color: #729fcf;">#if</span><span style="color: #729fcf;">n</span><span style="color: #729fcf;">def</span> ONLINE_JUDGE
    <span style="color: #ff6347;">freopen</span>(<span style="color: #ad7fa8; font-style: italic;">"input.txt"</span>, <span style="color: #ad7fa8; font-style: italic;">"r"</span>, stdin);
<span style="color: #729fcf;">#endif</span>
    cin &gt;&gt; N &gt;&gt; M;

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=1;j&lt;=N;j++) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (i != j) dp[i][j] = INF;
            arr[i][j] = INF;
        }
    }

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>, <span style="color: #ff6347;">b</span>, <span style="color: #ff6347;">c</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;M;i++) {
        cin &gt;&gt; a &gt;&gt; b &gt;&gt; c;
        dp[a][b] = c;
        dp[b][a] = c;
        arr[a][b] = b;
        arr[b][a] = a;
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">k</span>=1;k&lt;=N;k++) {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
            <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=1;j&lt;=N;j++) {
                <span style="color: #729fcf; font-weight: bold;">if</span> (dp[i][j] &gt; dp[i][k] + dp[k][j]) {
                    dp[i][j] = dp[i][k] + dp[k][j];
                    arr[i][j] = arr[i][k];
                }
            }
        }
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=1;j&lt;=N;j++) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (arr[i][j] == INF )
                cout &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'-'</span> &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">" "</span>;
            <span style="color: #729fcf; font-weight: bold;">else</span>
                cout &lt;&lt; arr[i][j] &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">" "</span>;
        }
        cout &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    }

    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbcdca66" class="outline-2">
<h2 id="orgbcdca66">문제 링크</h2>
<div class="outline-text-2" id="text-orgbcdca66">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/1719">https://www.acmicpc.net/problem/1719</a></li>
</ul>
</div>
</div>

<div id="outline-container-org069fafe" class="outline-2">
<h2 id="org069fafe">풀이 해설</h2>
<div class="outline-text-2" id="text-org069fafe">
<ul class="org-ul">
<li><a href="https://beginthread.tistory.com/63">https://beginthread.tistory.com/63</a></li>
<li><a href="https://ongveloper.tistory.com/181">https://ongveloper.tistory.com/181</a></li>
</ul>
</div>
</div>
